graph 636581f627fd4fff98ef1d7608898270 (
  %float_input[FLOAT, ?x8]
) {
  %label, %probabilities = TreeEnsembleClassifier[base_values = [-1.18031227588654], class_ids = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], class_nodeids = [3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14, 3, 4, 6, 7, 10, 11, 13, 14], class_treeids = [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11, 11, 11, 11, 12, 12, 12, 12, 12, 12, 12, 12, 13, 13, 13, 13, 13, 13, 13, 13, 14, 14, 14, 14, 14, 14, 14, 14, 15, 15, 15, 15, 15, 15, 15, 15, 16, 16, 16, 16, 16, 16, 16, 16, 17, 17, 17, 17, 17, 17, 17, 17, 18, 18, 18, 18, 18, 18, 18, 18, 19, 19, 19, 19, 19, 19, 19, 19, 20, 20, 20, 20, 20, 20, 20, 20, 21, 21, 21, 21, 21, 21, 21, 21, 22, 22, 22, 22, 22, 22, 22, 22, 23, 23, 23, 23, 23, 23, 23, 23, 24, 24, 24, 24, 24, 24, 24, 24, 25, 25, 25, 25, 25, 25, 25, 25, 26, 26, 26, 26, 26, 26, 26, 26, 27, 27, 27, 27, 27, 27, 27, 27, 28, 28, 28, 28, 28, 28, 28, 28, 29, 29, 29, 29, 29, 29, 29, 29, 30, 30, 30, 30, 30, 30, 30, 30, 31, 31, 31, 31, 31, 31, 31, 31, 32, 32, 32, 32, 32, 32, 32, 32, 33, 33, 33, 33, 33, 33, 33, 33, 34, 34, 34, 34, 34, 34, 34, 34, 35, 35, 35, 35, 35, 35, 35, 35, 36, 36, 36, 36, 36, 36, 36, 36, 37, 37, 37, 37, 37, 37, 37, 37, 38, 38, 38, 38, 38, 38, 38, 38, 39, 39, 39, 39, 39, 39, 39, 39, 40, 40, 40, 40, 40, 40, 40, 40, 41, 41, 41, 41, 41, 41, 41, 41, 42, 42, 42, 42, 42, 42, 42, 42, 43, 43, 43, 43, 43, 43, 43, 43, 44, 44, 44, 44, 44, 44, 44, 44, 45, 45, 45, 45, 45, 45, 45, 45, 46, 46, 46, 46, 46, 46, 46, 46, 47, 47, 47, 47, 47, 47, 47, 47, 48, 48, 48, 48, 48, 48, 48, 48, 49, 49, 49, 49, 49, 49, 49, 49, 50, 50, 50, 50, 50, 50, 50, 50, 51, 51, 51, 51, 51, 51, 51, 51, 52, 52, 52, 52, 52, 52, 52, 52, 53, 53, 53, 53, 53, 53, 53, 53, 54, 54, 54, 54, 54, 54, 54, 54, 55, 55, 55, 55, 55, 55, 55, 55, 56, 56, 56, 56, 56, 56, 56, 56, 57, 57, 57, 57, 57, 57, 57, 57, 58, 58, 58, 58, 58, 58, 58, 58, 59, 59, 59, 59, 59, 59, 59, 59, 60, 60, 60, 60, 60, 60, 60, 60, 61, 61, 61, 61, 61, 61, 61, 61, 62, 62, 62, 62, 62, 62, 62, 62, 63, 63, 63, 63, 63, 63, 63, 63, 64, 64, 64, 64, 64, 64, 64, 64, 65, 65, 65, 65, 65, 65, 65, 65, 66, 66, 66, 66, 66, 66, 66, 66, 67, 67, 67, 67, 67, 67, 67, 67, 68, 68, 68, 68, 68, 68, 68, 68, 69, 69, 69, 69, 69, 69, 69, 69, 70, 70, 70, 70, 70, 70, 70, 70, 71, 71, 71, 71, 71, 71, 71, 71, 72, 72, 72, 72, 72, 72, 72, 72, 73, 73, 73, 73, 73, 73, 73, 73, 74, 74, 74, 74, 74, 74, 74, 74, 75, 75, 75, 75, 75, 75, 75, 75, 76, 76, 76, 76, 76, 76, 76, 76, 77, 77, 77, 77, 77, 77, 77, 77, 78, 78, 78, 78, 78, 78, 78, 78, 79, 79, 79, 79, 79, 79, 79, 79, 80, 80, 80, 80, 80, 80, 80, 80], class_weights = [-0.00363392964936793, -0.0128321414813399, -0.00182942638639361, -0.0077592758461833, 4.78597103210632e-05, -0.00399154191836715, 0.00120406516361982, -0.00264487997628748, -0.00582806533202529, -0.00338212959468365, -0.00180810759775341, -0.00769375264644623, 4.72545143566094e-05, -0.00394971249625087, 0.00118811032734811, -0.00261528138071299, -0.00355581613257527, -0.0127406949177384, -0.00178702035918832, -0.0076286792755127, 4.66585333924741e-05, -0.00390825793147087, 0.00117237691301852, -0.00258597917854786, -0.0057387463748455, -0.00330618000589311, -0.00176615943200886, -0.00756405759602785, 4.60691808257252e-05, -0.00386717286892235, 0.00115686026401818, -0.00255697499960661, -0.00347914407029748, -0.0126505987718701, -0.00174552609678358, -0.00749987829476595, 4.5487435272662e-05, -0.00382645917125046, 0.00114192964974791, -0.00249723694287241, -0.00344170304015279, -0.0125798406079412, -0.00172511453274637, -0.00743613392114639, 4.49142826255411e-05, -0.0037861093878746, 0.00112681731116027, -0.0025397774297744, -0.00561782345175743, -0.00319341174326837, -0.00170492683537304, -0.00737282400950789, 4.43425815319642e-05, -0.00374612375162542, 0.000928777153603733, 0.00169360253494233, -0.00336715113371611, -0.0124919349327683, -0.00168495788238943, -0.00730994297191501, 4.37836533819791e-05, -0.00370650016702712, 0.00109796470496804, -0.00249281013384461, -0.00553169380873442, -0.0031210333108902, -0.00166521046776325, -0.00724748754873872, 4.3232153984718e-05, -0.00366723560728133, 0.00108351814560592, -0.00254131597466767, -0.00528285466134548, -0.00303388689644635, -0.00155413465108722, -0.00756739685311913, 9.41509133554064e-05, -0.00343940616585314, 0.000888388371095061, 0.00164340040646493, -0.00325832446105778, -0.0123884379863739, -0.00162703893147409, -0.00712055806070566, 4.32334709330462e-05, -0.00359022500924766, 0.00105554342735559, -0.00253122975118458, -0.00574311194941401, -0.00304390443488955, -0.00198864587582648, -0.00111005210783333, 4.26838123530615e-05, -0.00355201656930149, 0.00104221655055881, -0.00249811843968928, -0.00586481299251318, -0.0030026757158339, -0.00149983062874526, -0.00743671925738454, 9.18703226489015e-05, -0.00332572450861335, 0.000849681906402111, 0.00159507885109633, -0.00565938744693995, -0.00297494209371507, -0.00194722157903016, -0.00107779493555427, 2.49066379183205e-05, -0.00385845429264009, 0.000816059182398021, 0.00155827053822577, -0.00560565991327167, -0.00294221704825759, -0.00192468473687768, -0.00106481788679957, 4.18893359892536e-05, -0.00343985250219703, 0.00100225524511188, -0.00254865549504757, -0.0030834935605526, -0.0122590828686953, -0.00153274065814912, -0.00696227047592402, 2.40620320255402e-05, -0.00378191145136952, 0.000792566512245685, 0.00152559799607843, -0.00572231551632285, -0.00286835059523582, -0.00142996513750404, -0.00729593494907022, 8.8568136561662e-05, -0.00317842746153474, 0.000976964365690947, -0.00251320446841419, -0.00549470540136099, -0.00284094270318747, -0.0018209902336821, -0.000926521955989301, 2.4310007574968e-05, -0.00370705220848322, 0.000779264431912452, 0.00152661337051541, -0.00544222630560398, -0.00280951918102801, -0.00149295432493091, -0.00682856095954776, 2.40027784457197e-05, -0.00366796553134918, 0.000759904447477311, 0.0014730003895238, -0.00291954330168664, -0.0151729295030236, -0.00136320444289595, -0.00717505440115929, 9.40035388339311e-05, -0.0032392714638263, 0.000939870486035943, -0.00258054374717176, -0.00536216329783201, -0.00274568819440901, -0.00149326329119503, -0.00688930414617062, -8.96284327609465e-05, -0.00491988519206643, 0.000706749968230724, 0.00151253724470735, -0.0053106932900846, -0.00271519855596125, -0.00147562474012375, -0.00683006178587675, -0.00015855445235502, -0.00641009584069252, 0.000672677007969469, 0.00146060984116048, -0.00525961350649595, -0.00268500670790672, -0.00145818188320845, -0.00677120639011264, -1.34739525492478e-06, -0.00397261884063482, 0.000897645542863756, -0.00258494447916746, -0.00279460311867297, -0.015091291628778, -0.00130005448590964, -0.00696271564811468, -0.000264589180005714, 0.000678245327435434, 0.00089390086941421, -0.00254348875023425, -0.00518195144832134, -0.00262362649664283, -0.00174227124080062, -0.000934475858230144, -0.000153364249854349, -0.00631377752870321, 0.000643626844976097, 0.00142016273457557, -0.00513186072930694, -0.00259434175677598, -0.00140762620139867, -0.00664265314117074, -0.000151440443005413, -0.00625687744468451, 0.000635289994534105, 0.00140120193827897, -0.00508215138688684, -0.00256534549407661, -0.0017053633928299, -0.000905381457414478, 1.71468018379528e-05, -0.00323712872341275, 0.000860985892359167, -0.00259638857096434, -0.00281526078470051, -0.00168542552273721, -0.000677973031997681, -0.00848663225769997, 6.05832210567314e-05, 0.000785654003266245, 0.00144006113987416, -0.00256727752275765, -0.00500545930117369, -0.00250509637407959, -0.00356962531805038, -0.00143417599610984, -0.000224104034714401, -0.00651510106399655, 0.000609653361607343, 0.00135611102450639, -0.00534713268280029, -0.00246440502814949, -0.00122470769565552, -0.00675724633038044, -0.000223342954996042, 0.00089511985424906, 0.000854589161463082, -0.00255937711335719, -0.00493176328018308, -0.00244665169157088, -0.00351838790811598, -0.00140178960282356, -0.000216379237826914, -0.00645040581002831, 0.000592933152802289, 0.00132695713546127, -0.00488360179588199, -0.00241913576610386, -0.00355070782825351, -0.00138871930539608, -0.000213675361010246, -0.00639315135776997, 0.000585269823204726, 0.00130930857267231, -0.00483581237494946, -0.00239189271815121, -0.00344425160437822, -0.00136869959533215, -0.000211003702133894, -0.00633628573268652, 0.000577707251068205, 0.00129190902225673, -0.00522274058312178, -0.00178605935070664, -0.000623827334493399, -0.0082502169534564, 4.29523970524315e-05, 0.000733927125111222, 0.00134733645245433, -0.00260609877295792, -0.0047697420231998, -0.00234158942475915, -0.00262947613373399, -0.0012666410766542, -0.000205405260203406, -0.0062646372243762, 0.00056323956232518, 0.00125848839525133, -0.00472284248098731, -0.00231513381004333, -0.00343390251509845, -0.0013213463826105, -0.00024613129789941, -0.00584494415670633, 0.000549502263311297, 0.0012701457599178, -0.00512526510283351, -0.00172566494438797, 0.000110546621726826, -0.00118779437616467, 3.52201059286017e-05, 0.000709933636244386, 0.00130009721033275, -0.0026052319444716, -0.00465817749500275, -0.00226625613868237, -0.00256191333755851, -0.00121785153169185, -0.000197478002519347, -0.00617129076272249, 0.000542129098903388, 0.00121003983076662, -0.00237510399892926, -0.0149318985641003, -0.00118078640662134, -0.00630732160061598, 1.51253880176228e-05, -0.00307610351592302, 0.000743419746868312, -0.00259599438868463, -0.00458865286782384, -0.00221326434984803, -0.00334425270557404, -0.00125707231927663, -0.000233817510888912, -0.00571533944457769, 0.000520815665367991, 0.00121381599456072, -0.00500706536695361, -0.00164936087094247, 0.00012915424304083, -0.00115291867405176, 0.000259619700955227, 0.00104711879976094, 0.0012471970403567, -0.00261034443974495, -0.00452571455389261, -0.00216623791493475, -0.00248297327198088, -0.00115599588025361, -0.000189334110473283, -0.0060479361563921, 0.000669880711939186, -0.00257939822040498, -0.00448074191808701, -0.0021415741648525, -0.00326951174065471, -0.00120997941121459, -0.00022735029051546, -0.0056203999556601, 0.000500348804052919, 0.0011746606323868, -0.00491430796682835, -0.00159330433234572, 0.000150247884448618, -0.00111955206375569, 0.000147093858686276, 0.00120450113900006, -0.000163644435815513, 0.0010632814373821, -0.00441914983093739, -0.0020958948880434, -0.00241932924836874, -0.00111102813389152, -0.000139466632390395, -0.0049909045919776, 0.000660286459606141, -0.00261253560893238, -0.00484482431784272, -0.00155671872198582, 0.000149502971908078, -0.0011038453085348, 0.000139894022140652, 0.00118361716158688, -0.000169867489603348, 0.00104124809149653, -0.00225130142644048, -0.0122720468789339, -0.00311931781470776, -0.00114506797399372, -0.000217658307519741, -0.00553738186135888, 0.000474551896331832, 0.00112343463115394, -0.00477536581456661, -0.0015209597768262, -0.000516047875862569, -0.00785053241997957, 0.000133895679027773, 0.00115781894419342, -0.000173684384208173, 0.0010186800500378, -0.00220574927516282, -0.0122027406468987, -0.00234363693743944, -0.00105196400545537, -0.000133672278025188, -0.00490695098415017, 0.000629101705271751, -0.00261895032599568, -0.00470682978630066, -0.00148594903293997, 0.000175660839886405, -0.00106535269878805, 0.000127121165860444, 0.00113787699956447, -0.000179388327524066, 0.0009976786095649, -0.00210965913720429, -0.0116446111351252, -0.00314814760349691, -0.00107438582926989, -0.000214373605558649, -0.00599727919325233, 0.000589563336689025, -0.00259310635738075, -0.00463971495628357, -0.00184703839477152, -0.00106859777588397, 0.00107842439319938, -2.66097886196803e-05, 0.000967922271229327, -0.000107645719253924, 0.000830990844406188, -0.00424080947414041, -0.00190952816046774, -0.00227128015831113, -0.000997182913124561, -6.80304656270891e-05, -0.00383394281379879, 0.00062417151639238, -0.00261559104546905, -0.00457396265119314, -0.00141984620131552, 0.000189468686585315, -0.00103762233629823, 0.000190558945178054, 0.000965059851296246, 0.00110138417221606, -0.00258628628216684, -0.003309820080176, -0.00136062304954976, -0.000469882681500167, -0.00769877713173628, 0.000108679007098544, 0.00108767359051853, -0.000193449828657322, 0.000951559108216316, -0.00114426750224084, -0.00702551798895001, -0.0021161416079849, -0.00110611331183463, -5.41007430001628e-05, -0.00318586709909141, 0.000608874950557947, -0.00258103455416858, -0.00186424562707543, -0.013465772382915, -0.000774896063376218, -0.00592407630756497, 0.000178391521330923, 0.000942240527365357, 0.00106775423046201, -0.00257367151789367, -0.00110858236439526, -0.00695054978132248, -0.00136238161940128, -9.45196661632508e-05, -0.000201746224774979, -0.00585698103532195, 0.000543195405043662, -0.00255596800707281, -0.00411652866750956, -0.00179535732604563, -0.0029632078949362, -0.000979188014753163, -5.74638579564635e-05, -0.00337439705617726, 0.00058781955158338, -0.0025272227358073, -0.00315908319316804, -0.00128035363741219, -0.000415194605011493, -0.00769863137975335, 0.000180123897735029, 0.000932841270696372, 0.00105655484367162, -0.00255529768764973, -0.00105331011582166, -0.00686525367200375, -0.00203228718601167, -0.00103554595261812, -0.00033308714046143, 0.000584669527597725, 0.000595137185882777, -0.00250268424861133, -0.00316574075259268, -0.00125361408572644, -0.000404319987865165, -0.00764084002003074, 0.000175296401721425, 0.000933304370846599, 0.00107005378231406, -0.00253219762817025, -0.00102328648790717, -0.00679593347012997, -0.00128787918947637, -3.9987986383494e-05, -0.000329765549395233, 0.00057511666091159, 0.00058145762886852, -0.00247834017500281, -0.00174298195634037, -0.0133847240358591, -0.000680244527757168, -0.00573571538552642, 0.000166145706316456, 0.000898617610801011, 0.00101440772414207, -0.00250919698737562, -0.000990289612673223, -0.00672328099608421, -0.00197085249237716, -0.000982346246019006, -0.000182890347787179, 0.000471012084744871, -0.000161003816174343, 0.000732482003513724, -0.00170849356800318, -0.0133224939927459, -0.000727978476788849, -0.00598195241764188, 5.53260833839886e-05, 0.000939273159019649, -0.000232898615649901, 0.0008660729508847, -0.000958047341555357, -0.006651327945292, -0.00118803104851395, 0.000730806728824973, -0.000187348865438253, -0.00571447238326073, 0.000488886958919466, -0.00249896035529673, -0.00183998909778893, -0.0119273094460368, -0.00282088248059154, -0.000863220077008009, -0.000181854076799937, 0.000460537121398374, 0.0006818727706559, -0.000388578104320914, -0.00165572471451014, -0.0132413608953357, -0.000638387864455581, -0.00562343886122108, 9.01335733942688e-05, 0.000848973519168794, 0.000836577091831714, -0.000383753329515457, -0.000904732325579971, -0.00656445464119315, -0.00119562016334385, 3.8472811866086e-05, -0.000249207951128483, 0.0005150864017196, 0.000574916659388691, -0.00245544221252203, -0.000893884745892137, -0.00650808354839683, -0.00188563589472324, -0.000906115572433919, -0.000180375136551447, -0.00565422652289271, 0.000466615048935637, -0.00248126499354839, -0.00160786684136838, -0.0131810130551457, -0.00061305274721235, -0.0055553400889039, 0.000135266236611642, 0.000872177828568965, 0.000979384640231729, -0.0024533171672374, -0.0040255063213408, -0.00115731346886605, -0.00741667347028852, 0.000230102945351973, -0.000178951086127199, 0.000441607407992706, -0.000188773017725907, 0.000674269220326096, -0.00167974701616913, -0.0144984358921647, 0.00565192475914955, -0.000803654314950109, 1.79570270120166e-05, 0.0008299007313326, -0.000259936292422935, 0.000805124640464783, -0.00415669474750757, -0.00108720362186432, 0.00133419677149504, -0.00283443881198764, -5.89826959185302e-05, -0.00367414113134146, 0.000484807620523497, -0.00243995175696909, -0.00154317251872271, -0.0130791468545794, -0.000582488137297332, -0.00549228675663471, 0.000143718352774158, 0.000899534206837416, 0.00207360531203449, 0.000647987006232142, -0.00391162605956197, -0.00110847712494433, -0.00732668861746788, 0.000262519140960649, -0.000178131827851757, 0.000430259853601456, 0.000620217819232494, -0.000407008948968723, -0.00405999878421426, -0.00105145934503525, 0.00134041183628142, -0.00278161955066025, -1.31992374008405e-05, 0.000753959582652897, -0.000269281968940049, 0.000775759690441191, 0.00838007405400276, -0.00156437826808542, -0.000560401240363717, -0.00544631108641624, 0.000135301728732884, 0.000871371943503618, 0.0020372997969389, 0.000630575639661402, -0.00381624395959079, -0.00107285031117499, -0.00725123891606927, 0.000280510546872392, -1.40391821332742e-05, 0.000737456488423049, -0.000269347918219864, 0.000759940245188773, -0.00146597437560558, -0.0130100417882204, -0.00054643233306706, -0.0054004518315196, 0.000257407256867737, 0.000894364260602742, 0.00857794191688299, -0.00381681323051453], classlabels_int64s = [0, 1], nodes_falsenodeids = [8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0, 8, 5, 4, 0, 0, 7, 0, 0, 12, 11, 0, 0, 14, 0, 0], nodes_featureids = [5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 5, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 5, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 5, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 5, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 5, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 5, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 5, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 1, 0, 0, 1, 5, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 1, 0, 0, 1, 5, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 1, 5, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 5, 0, 0, 6, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 5, 6, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 6, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 6, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 6, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 5, 1, 5, 0, 0, 0, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 6, 5, 0, 0, 0, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 6, 0, 0, 5, 1, 5, 0, 0, 0, 0, 0, 5, 1, 0, 0, 5, 0, 0, 5, 6, 5, 0, 0, 0, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 6, 0, 0, 5, 1, 5, 0, 0, 0, 0, 0, 5, 1, 0, 0, 1, 0, 0, 5, 5, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 5, 0, 0], nodes_missing_value_tracks_true = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], nodes_modes = ['BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'BRANCH_LT', 'LEAF', 'LEAF', 'BRANCH_LT', 'LEAF', 'LEAF'], nodes_nodeids = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14], nodes_treeids = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 6, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 11, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 12, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 13, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 14, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 15, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17,